//A019RUN JOB (ACCT),'EMI BATCH',CLASS=A,MSGCLASS=A
//STEP1   EXEC PGM=EMIPROC
//STEPLIB DD DSN=A019.AKASH.LOADLIB,DISP=SHR
//EMIIN   DD DSN=A019.AKASH.EMI.INPUT,DISP=SHR
//KSDSACC DD DSN=A019.AKASH.EMI.KSDS,DISP=SHR
//SYSOUT  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
