IDENTIFICATION DIVISION.
PROGRAM-ID. CELSIUS-TO-F.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CELSIUS     PIC 9(3)V9.
01 FAHRENHEIT  PIC 9(3)V9.

PROCEDURE DIVISION.
    ACCEPT CELSIUS
    COMPUTE FAHRENHEIT = (CELSIUS * 9 / 5) + 32
    DISPLAY "Fahrenheit = " FAHRENHEIT
    STOP RUN.
