IDENTIFICATION DIVISION.
PROGRAM-ID. COMPOUND-INTEREST.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 P      PIC 9(6).
01 R      PIC 9(2)V9.
01 T      PIC 9(2).
01 AMOUNT PIC 9(8)V9.

PROCEDURE DIVISION.
    ACCEPT P
    ACCEPT R
    ACCEPT T
    COMPUTE AMOUNT = P * (1 + R / 100) ** T
    DISPLAY "Compound Amount = " AMOUNT
    STOP RUN.
