IDENTIFICATION DIVISION.
PROGRAM-ID. CONCAT.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 STR1 PIC X(20).
01 STR2 PIC X(20).
01 STR3 PIC X(40).
01 LEN  PIC 9(2).

PROCEDURE DIVISION.
    ACCEPT STR1
    ACCEPT STR2

    STRING STR1 DELIMITED BY SPACE
           STR2 DELIMITED BY SPACE
           INTO STR3
    END-STRING

    COMPUTE LEN = FUNCTION LENGTH(FUNCTION TRIM(STR3))

    DISPLAY STR3
    DISPLAY "Length = " LEN
    STOP RUN.
