IDENTIFICATION DIVISION.
PROGRAM-ID. SIMPLE-INTEREST.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 P   PIC 9(6).
01 R   PIC 9(2)V9.
01 T   PIC 9(2).
01 SI  PIC 9(6)V9.

PROCEDURE DIVISION.
    ACCEPT P
    ACCEPT R
    ACCEPT T
    COMPUTE SI = (P * R * T) / 100
    DISPLAY "Simple Interest = " SI
    STOP RUN.
