IDENTIFICATION DIVISION.
PROGRAM-ID. SUM20.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-ARRAY.
   05 NUM OCCURS 20 TIMES PIC 9(3).
01 I        PIC 9(2).
01 TOTAL    PIC 9(6) VALUE 0.

PROCEDURE DIVISION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 20
        ACCEPT NUM(I)
        ADD NUM(I) TO TOTAL
    END-PERFORM

    DISPLAY "Sum = " TOTAL
    STOP RUN.
